

Напишите программу, которая считывает слова, слово «стоп» — сигнал остановки (оно не должно принимать участие в анализе). Из введённых слов нужно выбрать самое длинное и самое короткое (гарантируется, что все они имеют разную длину) и проверить, есть ли все буквы короткого слова в длинном, при этом количество повторений букв не учитывается. Вывести «ДА» или «НЕТ» в зависимости от этого.
Формат ввода

Слова разной длины, из которых нужно выбрать кратчайшее и длиннейшее.
После этих слов следует слово «стоп».
Формат вывода

ДА или НЕТ
